---
title: DividedPathFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DividedPathFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# DividedPathFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId DividedPathCannotApplyDivideSettings { get; }` | `DividedPathFailures.DividedPathCannotApplyDivideSettings` | FailureDefinitionId |
| `FailureDefinitionId DividedPathCannotBeMirroredWithoutItsCurves { get; }` | `DividedPathFailures.DividedPathCannotBeMirroredWithoutItsCurves` | FailureDefinitionId |
| `FailureDefinitionId DividedPathCannotCreateFromGeometry { get; }` | `DividedPathFailures.DividedPathCannotCreateFromGeometry` | FailureDefinitionId |
| `FailureDefinitionId DividedPathDistanceTooSmall { get; }` | `DividedPathFailures.DividedPathDistanceTooSmall` | FailureDefinitionId |
| `FailureDefinitionId DividedPathIndentsOverlap { get; }` | `DividedPathFailures.DividedPathIndentsOverlap` | FailureDefinitionId |
| `FailureDefinitionId DividedPathIntersectionPolycurveParamsStepFailed { get; }` | `DividedPathFailures.DividedPathIntersectionPolycurveParamsStepFailed` | FailureDefinitionId |
| `FailureDefinitionId DividedPathInvalidNumberOfPoints { get; }` | `DividedPathFailures.DividedPathInvalidNumberOfPoints` | FailureDefinitionId |
| `FailureDefinitionId DividedPathLayoutStepFailed { get; }` | `DividedPathFailures.DividedPathLayoutStepFailed` | FailureDefinitionId |
| `FailureDefinitionId DividedPathUpdateMergedPointKeysStepFailed { get; }` | `DividedPathFailures.DividedPathUpdateMergedPointKeysStepFailed` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```